
## Plan Result (test_vpn_gateway)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_public_ip.this[0]
  * azurerm_virtual_network_gateway.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_public_ip.this[0] will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Dynamic"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "lab-vpn-test-public-ip"
      + resource_group_name     = "lab-vpn-test-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_virtual_network_gateway.this[0] will be created
  + resource "azurerm_virtual_network_gateway" "this" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = true
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "uksouth"
      + name                                  = "lab-vpn-test-gateway"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "lab-vpn-test-rg"
      + sku                                   = "Basic"
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "vnetGatewayConfig"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = "/subscriptions/5a8abf1c-0a69-49c6-bcf1-676843b64217/resourceGroups/lab-vpn-test-rg/providers/Microsoft.Network/virtualNetworks/lab-vpn-vpn-test/subnets/GatewaySubnet"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":409,"Program":"tfcmt","SHA1":"","Target":"test_vpn_gateway","Vars":{}} -->